cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/services"

brew "coreutils"                     # GNU core utilities (better versions of ls, cat, etc.)
brew "git"                           # Git version control
brew "htop"                          # System monitoring tool
brew "jq"                            # JSON parser
brew "openconnect"                   # VPN client
brew "bat"                           # Better `cat` with syntax highlighting
brew "selecta"                       # Interactive command-line filter
brew "pass"                          # Unix password manager
brew "thefuck"                       # Fix command typos automatically
brew "tmux"                          # Terminal multiplexer
brew "stow"                          # Dotfile management
brew "prettyping"                    # Better `ping` with graphs
brew "fzf"                           # Fuzzy finder (useful for searching history/files)
brew "autojump"                      # Quick directory jumping
brew "reattach-to-user-namespace"    # Fixes copy-paste issues in tmux
